# 중복

In [1]:
import pandas as pd

In [50]:
df = pd.DataFrame({'Num':[1, 2, 1, 2, 2, 3], 
                   'Alphabet':['a', 'b', 'a', 'b', 'a', 'b']})
df

   Num Alphabet
0    1        a
1    2        b
2    1        a
3    2        b
4    2        a
5    3        b

###  중복 확인(duplicated)

In [34]:
df[df.duplicated()]

   Num Alphabet
2    1        a
3    2        b

In [61]:
df[df.duplicated(keep='last')] # 아래부터 확인하여 두번째로 확인되는 값을 리턴

   Num Alphabet
0    1        a
1    2        b

In [ ]:
df[df.duplicated(keep=True)] # 모든 중복값 True로

In [62]:
df[df.duplicated(subset=['Num'])] # 특정 열에서 중복을 찾기

   Num Alphabet
2    1        a
3    2        b
4    2        a

In [56]:
# 몇번 중복된 데이터인지 확인하기 : cumcount가 0인 경우 중복되지 않음
df.groupby(['Num'], as_index=False).cumcount()

0    0
1    0
2    1
3    1
4    2
5    0
dtype: int64

### 중복 제거(drop_duplicates)

In [4]:
# 중복 제거
df.drop_duplicates(subset=None, keep='first', inplace=False, ignore_index=False)b

   Num Alphabet
0    1        a
1    2        b
4    2        a
5    3        b

In [59]:
# 추천하지 않는 방법 : ~ 이용

df[~df[['Num', 'Alphabet']].duplicated()]

   Num Alphabet
0    1        a
1    2        b
4    2        a
5    3        b

In [19]:
# 아무것도 지정하지 않을 시 : 모든 열을 기준으로 중복 제거
df.drop_duplicates()

   Num Alphabet
0    1        a
1    2        b
4    2        a
5    3        b

In [21]:
# 열 지정하여 중복제거
df.drop_duplicates(['Num']) # 한개

   Num Alphabet
0    1        a
1    2        b
5    3        b

In [23]:
df.drop_duplicates(['Num', 'Alphabet']) # 여러개

   Num Alphabet
0    1        a
1    2        b
4    2        a
5    3        b

In [42]:
# 남길 대상 지정

# 첫번째만 남기기 : 중복값중 인덱스를 기준으로 가장 앞에 있는 행만 남음
df.drop_duplicates(['Num'], keep='first')

   Num Alphabet
0    1        a
1    2        b
5    3        b

In [46]:
# 마지막만 남기기 : 중복값중 인덱스를 기준으로 가장 마지막에 있는 행만 남음
df.drop_duplicates(['Num'], keep='last')

   Num Alphabet
2    1        a
4    2        a
5    3        b

In [48]:
# 모두 제거 : 중복되는 데이터가 있는 모든 행 제거
df.drop_duplicates(['Num'], keep=False)

   Num Alphabet
5    3        b

In [32]:
# 인덱스 재설정 : 중복값을 제외하면 기존의 인덱스를 따랐기 때문에, 사라진 행의 인덱스가 비게 되므로d

df.drop_duplicates(['Num'], ignore_index=True)

   Num Alphabet
0    1        a
1    2        b
2    3        b